Repository: Foreverlongdamai/pilot-assessment-AI-system
Catalog: src/PilotAssessment.Desktop/Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Runs_ScientificAuthorized
source: Formal assessment is authorized by the selected scheme/session metadata.
zh_cn: 所选方案和 Session 元数据允许正式评估。

# Runs_ScientificSynthetic
source: Engineering / synthetic run: useful for workflow verification, not a validated pilot assessment.
zh_cn: 工程／合成运行：可验证工作流，但不是经过验证的飞行员评估。

# Runs_ScientificNotAuthorized
source: Engineering run: formal assessment is not authorized. Technical execution remains available.
zh_cn: 工程运行：尚未授权正式评估，但仍可执行技术计算。

# Runs_NoFrozenSnapshot
source: No frozen run snapshot selected.
zh_cn: 未选择冻结运行快照。

# Runs_Idle
source: Idle
zh_cn: 空闲

# Runs_Ready
source: Ready
zh_cn: 就绪

# Runs_Blocked
source: Blocked
zh_cn: 已阻止

# Runs_State_Queued
source: Queued
zh_cn: 已排队

# Runs_State_Running
source: Running
zh_cn: 运行中

# Runs_State_Cancelling
source: Cancelling
zh_cn: 正在取消

# Runs_State_Cancelled
source: Cancelled
zh_cn: 已取消

# Runs_State_Completed
source: Completed
zh_cn: 已完成

# Runs_State_Failed
source: Failed
zh_cn: 失败

# Runs_State_Interrupted
source: Interrupted
zh_cn: 已中断

# Runs_Stage_Queued
source: Queued
zh_cn: 排队

# Runs_Stage_SnapshotValidation
source: Snapshot validation
zh_cn: 快照验证

# Runs_Stage_Ingestion
source: Ingestion
zh_cn: 数据摄取

# Runs_Stage_Synchronization
source: Synchronization
zh_cn: 时间同步

# Runs_Stage_Evidence
source: Evidence extraction
zh_cn: 证据提取

# Runs_Stage_Inference
source: Bayesian inference
zh_cn: 贝叶斯推理

# Runs_Stage_Reporting
source: Reporting
zh_cn: 报告生成

# Runs_Stage_Completed
source: Completed
zh_cn: 已完成

# Results_Title
source: Assessment results
zh_cn: 评估结果

# Results_Description
source: Inspect backend-verified Evidence observations, Bayesian posteriors, read-only inference influence, provenance and managed artifact references for an immutable run snapshot.
zh_cn: 查看不可变运行快照对应的后端校验证据观测、贝叶斯后验、只读推理影响、来源信息和受管工件引用。

# Results_OperationFailed
source: Result operation failed
zh_cn: 结果操作失败

# Results_Load
source: Load result
zh_cn: 加载结果

# Results_CompletedRuns
source: Completed current-model runs
zh_cn: 已完成的当前模型运行

# Results_Summary
source: Immutable result summary
zh_cn: 不可变结果摘要

# Results_ScientificStatus
source: Scientific status
zh_cn: 科学状态

# Results_EvidenceTab
source: Evidence / observations
zh_cn: 证据／观测

# Results_EvidenceDau
source: Evidence D / A / U scoring
zh_cn: 证据 D／A／U 评分

# Results_Observations
source: Bayesian hard, virtual or omitted observations
zh_cn: 贝叶斯硬观测、虚拟观测或省略观测

# Results_PosteriorTab
source: BN posterior
zh_cn: BN 后验

# Results_InfluenceTab
source: Inference influence
zh_cn: 推理影响

# Results_InfluenceNotCanonical
source: Explanation overlay — not a canonical edge
zh_cn: 解释叠加层——不是规范边

# Results_ArtifactsTab
source: Artifacts / coverage
zh_cn: 工件／覆盖度

# Results_ProvenanceTab
source: Provenance
zh_cn: 来源信息

# Results_ShowInFolder
source: Show in folder
zh_cn: 在文件夹中显示

# Results_StatusStart
source: Completed current-model runs will appear here.
zh_cn: 已完成的当前模型运行会显示在这里。

# Results_NoCurrentResults
source: No completed current-model result is stored in this project yet.
zh_cn: 该项目尚未存储已完成的当前模型结果。

# Results_ArtifactOpened
source: The verified managed artifact was selected in Windows Explorer.
zh_cn: 已在文件资源管理器中选中经验证的受管工件。

# Results_StatusLoaded
source: Result artifacts were verified by the backend and projected read-only.
zh_cn: 结果工件已由后端验证，并以只读方式投影。

# Results_NoCoverageArtifacts
source: No separate coverage artifact was emitted for this run.
zh_cn: 本次运行没有生成独立覆盖度工件。

# Results_CoverageArtifacts
source: {0} verified coverage artifact(s) are available below.
zh_cn: 下方提供 {0} 个经验证的覆盖度工件。

# Results_NoResultLoaded
source: No result loaded.
zh_cn: 未加载结果。

# Results_ScientificUnknown
source: Scientific status is not available.
zh_cn: 科学状态不可用。

# Results_InfluenceExplanation
source: Inference influence is a read-only explanation from this result. It is not a canonical BN edge and cannot be edited into the model graph.
zh_cn: 推理影响只是该结果的只读解释，不是规范 BN 边，也不能编辑进模型图。

# Results_ScientificNotSupported
source: Scientific status: not supported / engineering workflow only.
zh_cn: 科学状态：不支持／仅工程工作流。

# Results_ScientificEngineering
source: Scientific status: engineering default.
zh_cn: 科学状态：工程默认。

# Results_ScientificExpertReviewed
source: Scientific status: expert reviewed.
zh_cn: 科学状态：专家已审查。

# Results_ScientificCalibrated
source: Scientific status: calibrated.
zh_cn: 科学状态：已校准。

# Results_ScientificInternal
source: Scientific status: internally validated.
zh_cn: 科学状态：内部验证。

# Results_ScientificExternal
source: Scientific status: externally validated.
zh_cn: 科学状态：外部验证。

source: Diagnostics refresh failed
zh_cn: 刷新诊断失败

# Diagnostics_BackendIdentity
source: Backend identity
zh_cn: 后端标识

# Diagnostics_RuntimeStatus
source: Runtime status
zh_cn: 运行时状态

# Diagnostics_ProjectRecovery
source: Project / run recovery
zh_cn: 项目／运行恢复

# Diagnostics_SchemaIdentities
source: Run and result schema identities
zh_cn: 运行与结果 Schema 标识

# Diagnostics_Capabilities
source: Capabilities
zh_cn: 能力列表

# Diagnostics_MethodCatalog
source: JSON-RPC method catalog
zh_cn: JSON-RPC 方法目录

# Diagnostics_AuditEvents
source: Recent audit events
zh_cn: 最近审计事件

# Diagnostics_NoRecoverableRuns
source: No queued, active or interrupted current-model run requires attention.
zh_cn: 没有需要处理的排队、活动或中断当前模型运行。

# Diagnostics_NoHandshake
source: No active backend handshake.
zh_cn: 没有活动的后端握手。

# RawFamily_X_Name
source: Flight State
zh_cn: 飞行状态

# RawFamily_X_Description
source: Position, attitude, velocity, acceleration, and other flight states
zh_cn: 位置、姿态、速度、加速度和其他飞行状态

# RawFamily_U_Name
source: Control Input
zh_cn: 操纵输入

# RawFamily_U_Description
source: Stick, pedal, thrust, and other control inputs
zh_cn: 操纵杆、踏板、推力和其他控制输入

# RawFamily_I_Name
source: Visual Input
zh_cn: 视觉输入

# RawFamily_I_Description
source: VR first-person view and associated visual acquisition
zh_cn: VR 第一视角及相关视觉采集入口

# RawFamily_G_Name
source: Gaze and AOI
zh_cn: 注视与 AOI

# RawFamily_G_Description
source: Gaze, fixation, stare, AOI, and field-of-view association
zh_cn: 注视、凝视、注视点、AOI 与视野关联

# RawFamily_P_Name
source: Physiology
zh_cn: 生理输入

# RawFamily_P_Description
source: EEG, ECG, and future physiological modalities
zh_cn: EEG、ECG 和后续生理模态

# RawFamily_Kind
source: RAW INPUT FAMILY
zh_cn: 原始输入族

# RawFamily_A11y
source: {0}(t) {1}, {2}, {3} source nodes
zh_cn: {0}(t) {1}，{2}，{3} 个来源节点

# Graph_ProvenanceEdge
source: Raw-input provenance (display only)
zh_cn: 原始输入溯源（仅展示）

# Dialog_SaveChangesTitle
source: Keep this editing session?
zh_cn: 是否保留本次编辑？

# Dialog_SaveChangesDescription
source: Your node, edge, CPT, task-scheme, parameter, and layout changes are currently staged in the project. Save all changes to the system model, discard all changes, or cancel closing.
zh_cn: 本次对节点、边、CPT、任务方案、参数和布局的修改目前暂存在这套软件副本中。你可以把全部修改保存到系统模型、放弃全部修改，或取消关闭。

# Dialog_SaveAndClose
source: Save all and close
zh_cn: 保存全部并关闭

# Dialog_DiscardAndClose
source: Discard all and close
zh_cn: 放弃全部并关闭

# Dialog_CloseFailedTitle
source: The application could not close safely
zh_cn: 软件无法安全关闭

# Dialog_CloseFailedDescription
source: Your editing session has been kept open. Resolve the following problem and try again: {0}
zh_cn: 本次编辑仍保留且软件保持打开。请解决以下问题后重试：{0}

# Model_LayerFilterA11y
source: Graph layer filter
zh_cn: 画布层级筛选

# Model_LayerAll
source: All layers
zh_cn: 全部层级

# Model_LayerRawFamily
source: Raw Input Family
zh_cn: 原始输入

# Model_LayerExtractedData
source: Extracted Data
zh_cn: 输入提取数据

# Model_LayerEvidence
source: Evidence
zh_cn: 证据

# Model_LayerSubSkill
source: Sub-skill
zh_cn: 子技能

# Model_LayerCompetency
source: Competency
zh_cn: 能力

# Model_StatusUndoing
source: Undoing the latest staged change…
zh_cn: 正在撤销最近一次暂存修改…

# Model_StatusUndone
source: The latest staged change was undone.
zh_cn: 已撤销最近一次暂存修改。

# Model_StatusUndoFailed
source: The staged change could not be undone.
zh_cn: 无法撤销暂存修改。

# Model_StatusRedoing
source: Restoring the latest undone change…
zh_cn: 正在恢复最近一次撤销的修改…

# Model_StatusRedone
source: The latest undone change was restored.
zh_cn: 已恢复最近一次撤销的修改。

# Model_StatusRedoFailed
source: The staged change could not be restored.
zh_cn: 无法恢复暂存修改。

# Diagnostics_BackendSource
source: Loaded backend source
zh_cn: 已加载的后端源码

# Diagnostics_SourceRestartRequired
source: Backend restart required
zh_cn: 需要重启后端

# Diagnostics_SourceRestartRequiredMessage
source: Backend source changed after startup. Save your model edits, close and reopen the application before starting a run.
zh_cn: 后端源码在启动后发生了变化。请保存模型编辑，关闭并重新打开应用，再开始评估。

# Diagnostics_SourceUnavailable
source: Backend source identity is not available from this runtime.
zh_cn: 当前运行时未提供后端源码身份。

# Diagnostics_BaselineUnavailable
source: not available (development runtime)
zh_cn: 不可用（开发运行环境）

# Diagnostics_BaselineModified
source: locally modified
zh_cn: 已在本地修改

# Diagnostics_BaselineClean
source: matches release baseline
zh_cn: 与发布基线一致

# Diagnostics_SourceRoot
source: Active source root
zh_cn: 活动源码根目录

# Diagnostics_SourceTreeHash
source: Source tree SHA-256
zh_cn: 源码树 SHA-256

# Diagnostics_ExecutionIdentity
source: Execution identity
zh_cn: 执行身份

# Diagnostics_ReleaseBaseline
source: Release baseline
zh_cn: 发布基线

# Diagnostics_Dependencies
source: Installed dependencies
zh_cn: 已安装依赖

# Diagnostics_OperatorCatalog
source: Operator catalog
zh_cn: Operator 目录

# Runs_FrozenBackendSource
source: Frozen backend source
zh_cn: 已冻结的后端源码

# Runs_LegacySourceIdentity
source: This historical run predates backend source provenance.
zh_cn: 这条历史运行早于后端源码溯源功能，因此没有保存源码身份。
